# A Deep dive into the Python Data Science Ecosystem

### The goal of today's lab is to equip you with enough information about the python libraries used in the data science process and to help you explore data using these tools

## The Scientific Python Ecosystem

![The Scientific Python Ecosystem](img/SciPy_ecosystem.png)

### NumPy lays the foundation for fast vectorized computation using n dimensional arrays

* __A Numpy Array is a homogenous collection of elements of the same data type (dtype)__

Numpy is the core library for scientific computing in Python. It provides a high-performance multidimensional array object, and tools for working with these arrays. 

##### To use Numpy, we first need to import the numpy package:

In [1]:
import numpy as np

##### Arrays

A numpy array is a grid of values, all of the same type, and is indexed by a tuple of nonnegative integers. 
The number of dimensions is the rank of the array
The shape of an array is a tuple of integers giving the size of the array along each dimension.

We can initialize numpy arrays from nested Python lists, and access elements using square brackets:

In [2]:
a = np.array([1, 2, 3])  # Create a rank 1 array
print (type(a))
print (a.shape)
print (a[0], a[1], a[2])
a[0] = 5                 # Change an element of the array
print (a)

<class 'numpy.ndarray'>
(3,)
1 2 3
[5 2 3]

![The Numpy Arrays](img/numpy_arrays.png)

* __Some suported dtypes in numpy arrays are given below__

![](img/numpy_dtypes.jpg)

## We will explore the following ideas

### Attributes of arrays

* __Determining the size, shape, memory consumption, and data types of arrays__

### Indexing of arrays
* __Getting and setting the value of individual array elements__

### Slicing of arrays
* __Getting and setting smaller subarrays within a larger array__

### Reshaping of arrays
* __Changing the shape of a given array__

In [3]:
b = np.array([[1,2,3],[4,5,6]])   # Create a rank 2 array
print (b)

[[1 2 3]
 [4 5 6]]

In [4]:
print (b.shape)
print (b[(0, 0)], b[0, 1], b[1, 0])

(2, 3)
1 2 4

##### Array indexing

Numpy offers several ways to index into arrays.

Slicing: Similar to Python lists, numpy arrays can be sliced. Since arrays may be multidimensional, you must specify a slice for each dimension of the array:

Create the following rank 2 array with shape (3, 4)
    [[ 1  2  3  4]
     [ 5  6  7  8]
     [ 9 10 11 12]]

In [5]:
a = np.array([[1,2,3,4], [5,6,7,8], [9,10,11,12]])
print (a)

[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]

Use slicing to pull out the subarray consisting of the first 2 rows and columns 1 and 2;
Resulting is the following array of shape (2, 2):
    [[2 3]
     [6 7]]

In [6]:
b = a[:2, 1:3]
print (b)

[[2 3]
 [6 7]]

#### ACTIVITY:
Create a 3X4 array as follows:

[[1   2   3   5  ]
 [10  20  30  50 ]  
 [100 200 300 500]]

From this extract out the array [[20   30 ]
                                 [200  300]]

### Conditional Indexing

Boolean array indexing: Boolean array indexing lets you pick out arbitrary elements of an array. Frequently this type of indexing is used to select the elements of an array that satisfy some condition. Here is an example:

In [7]:
a = np.array([[1,2], [3, 4], [5, 6]])

bool_idx = (a > 2)  # Find the elements of a that are bigger than 2;
                    # this returns a numpy array of Booleans of the same
                    # shape as a, where each slot of bool_idx tells
                    # whether that element of a is > 2.

print (bool_idx)

[[False False]
 [ True  True]
 [ True  True]]

In [8]:
# We use boolean array indexing to construct a rank 1 array
# consisting of the elements of a corresponding to the True values
# of bool_idx
print (a[bool_idx])

# We can do all of the above in a single concise statement:
print (a[a > 2])

[3 4 5 6]
[3 4 5 6]

Numpy tries to guess a datatype when you create an array, but functions that construct arrays usually also include an optional argument to explicitly specify the datatype. Here is an example:

In [9]:
x = np.array([1, 2])  # Let numpy choose the datatype
y = np.array([1.0, 2.0])  # Let numpy choose the datatype
z = np.array([1, 2], dtype=np.int64)  # Force a particular datatype

print (x.dtype, y.dtype, z.dtype)

int32 float64 int64

#### ACTIVITY:

From the "a" numpy array extract only those elements that are divisible by 2

array([2, 4, 6])

### Min-Max scaling using numpy

In [10]:
import numpy as np

# Create a numpy array that starts at 0 and end at 99

A = np.arange(100)

print(A)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47
 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71
 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95
 96 97 98 99]

In [11]:
Amax, Amin = A.max(), A.min()

print(Amax, Amin)

99 0

In [12]:
Ascaled = (A - Amin)/(Amax - Amin)

print(Ascaled)

[0.         0.01010101 0.02020202 0.03030303 0.04040404 0.05050505
 0.06060606 0.07070707 0.08080808 0.09090909 0.1010101  0.11111111
 0.12121212 0.13131313 0.14141414 0.15151515 0.16161616 0.17171717
 0.18181818 0.19191919 0.2020202  0.21212121 0.22222222 0.23232323
 0.24242424 0.25252525 0.26262626 0.27272727 0.28282828 0.29292929
 0.3030303  0.31313131 0.32323232 0.33333333 0.34343434 0.35353535
 0.36363636 0.37373737 0.38383838 0.39393939 0.4040404  0.41414141
 0.42424242 0.43434343 0.44444444 0.45454545 0.46464646 0.47474747
 0.48484848 0.49494949 0.50505051 0.51515152 0.52525253 0.53535354
 0.54545455 0.55555556 0.56565657 0.57575758 0.58585859 0.5959596
 0.60606061 0.61616162 0.62626263 0.63636364 0.64646465 0.65656566
 0.66666667 0.67676768 0.68686869 0.6969697  0.70707071 0.71717172
 0.72727273 0.73737374 0.74747475 0.75757576 0.76767677 0.77777778
 0.78787879 0.7979798  0.80808081 0.81818182 0.82828283 0.83838384
 0.84848485 0.85858586 0.86868687 0.87878788 0.88888889 0.8989899
 0.90909091 0.91919192 0.92929293 0.93939394 0.94949495 0.95959596
 0.96969697 0.97979798 0.98989899 1.        ]

* __Why does this work?__

### Vectorized Operations in Numpy

![](img/numpy_vectorized_computation.jpg)

### Reshaping Numpy arrays

In [13]:
print (a)

[[1 2]
 [3 4]
 [5 6]]

In [14]:
a.shape

(3, 2)

In [15]:
a_reshape = a.reshape((2,3))
print (a_reshape)

[[1 2 3]
 [4 5 6]]

In [16]:
a_reshape.shape

(2, 3)

# Understanding Pandas

## Pandas has two core data structures the series and the dataframe objects

### A pandas series object is like an ordered dictionary, so you can access elements by their position as well as labels

### A pandas series object is analogous to a named list in R

In [17]:
import pandas as pd

dataFromList = pd.Series([0.25, 0.5, 0.75, "Make India Great Again!"], index=['a', 'b', 'c', 'd'])

print(dataFromList)

a                       0.25
b                        0.5
c                       0.75
d    Make India Great Again!
dtype: object

In [18]:
dataFromDict = pd.Series({"a" : 0.25, "b" :  0.5, "c" : 0.75, "d" : "Make India Great Again!"})

print(dataFromDict)

a                       0.25
b                        0.5
c                       0.75
d    Make India Great Again!
dtype: object

* __Below we access the same element from the pandas series object using both the index as well as the position of the element in the series__

In [19]:
print("Using the Index: " + str(dataFromDict['d']))

print("Using the Position: " + str(dataFromDict[3]))

Using the Index: Make India Great Again!
Using the Position: Make India Great Again!

## Pandas DataFrames

* __The Pandas DataFrame object is a combination of labelled series objects__

In [20]:
sampleDataFromDictOfDicts = pd.DataFrame({'Batch': { "Akhil" : 25, "Mayank": 27, "Lakshmi": 30, "Yogesh": 32, "Ashwin": 35},
                            'Scholarship_winners': { "Akhil" : 5, "Mayank": 4, "Lakshmi": 3, "Yogesh": 5, "Ashwin": 5}})

sampleDataFromDictOfDicts

         Batch  Scholarship_winners
Akhil       25                    5
Ashwin      35                    5
Lakshmi     30                    3
Mayank      27                    4
Yogesh      32                    5

In [21]:
sampleDataFromDict = pd.DataFrame({'Batch': [25, 27, 30, 32, 35],
                                   'Scholarship_winners': [5,4,3,5,5]})

sampleDataFromDict

   Batch  Scholarship_winners
0     25                    5
1     27                    4
2     30                    3
3     32                    5
4     35                    5

In [22]:
sampleDataFromList = pd.DataFrame([[25, 5], [27, 4], [30, 3], [32, 5], [35, 5]],
                                  columns = ["Batch", "Scholarship_winners"],
                                  index=["Akhil", "Mayank", "Lakshmi", "Yogesh", "Ashwin"])

sampleDataFromList

         Batch  Scholarship_winners
Akhil       25                    5
Mayank      27                    4
Lakshmi     30                    3
Yogesh      32                    5
Ashwin      35                    5

# Going From Pandas to Numpy and Back

* __Sometimes data should be in a numpy array form before being passed into functions from other libraries, so you need to be comfortable converting objects from pandas dataframes to numpy arrays and vice versa__

* __You lose your indexes and columns, some times additional datatypes supported in pandas (ex: datetime) when you convert pandas dataframes to numpy arrays__

In [23]:
sampleNpData = sampleDataFromList.values # Pandas to Numpy Array

sampleNpData

array([[25,  5],
       [27,  4],
       [30,  3],
       [32,  5],
       [35,  5]], dtype=int64)

In [24]:
samplePdData = pd.DataFrame(sampleNpData, columns=sampleDataFromList.columns, 
                            index=["Akhil", "Mayank", "Lakshmi", "Yogesh", "Ashwin"])

samplePdData

         Batch  Scholarship_winners
Akhil       25                    5
Mayank      27                    4
Lakshmi     30                    3
Yogesh      32                    5
Ashwin      35                    5

# Accessing Elements from a Pandas DataFrame

# iloc vs loc

### __.iloc lets you access the elements using the position of the elements__

![](img/pd_iloc.jpg)

In [25]:
allColumns = samplePdData.iloc[3, : ]

print("All Columns: " + "\n---------------------------------\n" + str(allColumns))

oneColumn = samplePdData.iloc[3, :1 ]

print("\n" + "Only the First Column: " + "\n---------------------------------\n" + str(oneColumn))

twoColumns = samplePdData.iloc[3, :2 ]

print("\n" + "Till The Second Column: " + "\n---------------------------------\n" + str(twoColumns))

All Columns:
---------------------------------
Batch                  32
Scholarship_winners     5
Name: Yogesh, dtype: int64

Only the First Column:
---------------------------------
Batch    32
Name: Yogesh, dtype: int64

Till The Second Column:
---------------------------------
Batch                  32
Scholarship_winners     5
Name: Yogesh, dtype: int64

### __.loc lets you access the elements using the column and the index labels of the elements__

![](img/pd_loc.jpg)

In [26]:
samplePdData.loc["Lakshmi", :"Scholarship_winners"]

Batch                  30
Scholarship_winners     3
Name: Lakshmi, dtype: int64

## Indexing using [ ] returns a Pandas Series Object

In [27]:
samplePdData['Batch']

Akhil      25
Mayank     27
Lakshmi    30
Yogesh     32
Ashwin     35
Name: Batch, dtype: int64

* __ You might come across this method of indexing when you want to conditionally access elements from a pandas DataFrame__

In [28]:
samplePdData.loc[samplePdData['Batch'] > 28, : ] # Here we access only those rows where the Batch number is higher than 28

         Batch  Scholarship_winners
Lakshmi     30                    3
Yogesh      32                    5
Ashwin      35                    5

## GroupBy in Pandas

### Finding the mean age at each Insofe Branch

In [29]:
cityData = pd.DataFrame( {"Name" : ["Akhil", "Mayank", "Yogesh", "Lakshmi", "Jeevan" , "Sridhar"] , 
                    "City" : ["Bangalore", "Hyderabad", "Bangalore", "Hyderabad", "Bangalore", "Hyderabad"],
                    "Age" : [25, 25, 23, 26, 27, 40]})
cityData

   Age       City     Name
0   25  Bangalore    Akhil
1   25  Hyderabad   Mayank
2   23  Bangalore   Yogesh
3   26  Hyderabad  Lakshmi
4   27  Bangalore   Jeevan
5   40  Hyderabad  Sridhar

* __Applying the GroupBy method returns a groupby object__

In [30]:
cityData.groupby(by = "City")

* __We can view the structure by converting it into a list__

In [31]:
list(cityData.groupby(by = "City"))

[('Bangalore',    Age       City    Name
  0   25  Bangalore   Akhil
  2   23  Bangalore  Yogesh
  4   27  Bangalore  Jeevan), ('Hyderabad',    Age       City     Name
  1   25  Hyderabad   Mayank
  3   26  Hyderabad  Lakshmi
  5   40  Hyderabad  Sridhar)]

* __You can perform operations on a groupby object to return a DataFrame__

In [32]:
cityData.groupby(by = "City").mean()

                 Age
City
Bangalore  25.000000
Hyderabad  30.333333

In [33]:
cityData.groupby(by = "City").count()

           Age  Name
City
Bangalore    3     3
Hyderabad    3     3

* __We can also apply any function to a groupby object using the apply method__

![](img/pd_apply.png)

In [34]:
cityData.groupby(by = "City").apply(sum)

           Age                         City                  Name
City
Bangalore   75  BangaloreBangaloreBangalore     AkhilYogeshJeevan
Hyderabad   91  HyderabadHyderabadHyderabad  MayankLakshmiSridhar

### Get and Set Working Directories

In [35]:
import os

In [36]:
os.getcwd() # Print your current working directory

'C:\\Users\\yoges\\Desktop\\Batch_39\\CSE7212c\\python_data_science\\previous_lab_activities'

In [37]:
os.chdir("C:\\Users\\yoges\\Desktop\\Batch_39\\CSE7212c\\python_data_science\\previous_lab_activities") 
# Change the working directory to the disered path

### Read CSV Files

In [38]:
grade = pd.read_csv("Grade1.csv",header=0)

grade

    StudentId  English1  Math1  Science1  OverallPct1
0           1        67     78        30           58
1           2        52     72        67           64
2           3        66     56        55           59
3           4        30     42        44           39
4           5        56     53        48           52
5           6        75     53        77           68
6           7        80     47        37           55
7           8        68     75        30           58
8           9        48     36        68           51
9          10        62     34        54           50
10         11        54     41        44           46
11         12        68     65        34           56
12         13        70     56        54           60
13         14        71     48        76           65
14         15        78     54        77           70
15         16        48     58        57           54
16         17        36     37        40           38
17         18        72     74        62           69
18         19        58     56        33           49
19         20        44     57        66           56

### Activity

### Read in the "Grade2.csv" file

### Dataset Understanding, Summary

#### Head and Tail Methods

In [39]:
grade.head()

   StudentId  English1  Math1  Science1  OverallPct1
0          1        67     78        30           58
1          2        52     72        67           64
2          3        66     56        55           59
3          4        30     42        44           39
4          5        56     53        48           52

In [40]:
grade.tail()

    StudentId  English1  Math1  Science1  OverallPct1
15         16        48     58        57           54
16         17        36     37        40           38
17         18        72     74        62           69
18         19        58     56        33           49
19         20        44     57        66           56

#### Data Frame Shape

In [41]:
grade.shape

(20, 5)

#### Summary of the dataset

In [42]:
grade.describe()

       StudentId   English1      Math1  Science1  OverallPct1
count   20.00000  20.000000  20.000000  20.00000    20.000000
mean    10.50000  60.150000  54.600000  52.65000    55.850000
std      5.91608  13.899167  13.188512  15.89861     8.975258
min      1.00000  30.000000  34.000000  30.00000    38.000000
25%      5.75000  51.000000  45.750000  39.25000    50.750000
50%     10.50000  64.000000  55.000000  54.00000    56.000000
75%     15.25000  70.250000  59.750000  66.25000    61.000000
max     20.00000  80.000000  78.000000  77.00000    70.000000

#### Data Types of each of the columns

In [43]:
grade.dtypes

StudentId      int64
English1       int64
Math1          int64
Science1       int64
OverallPct1    int64
dtype: object

#### Row Names (Referred to as Index)

In [44]:
grade.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19], dtype=int64)

#### Column Names (Referred to as Columns)

In [45]:
grade.columns.values

array(['StudentId', 'English1', 'Math1', 'Science1', 'OverallPct1'],
      dtype=object)

### Data Types and Conversions in Pandas Data Frames

#### Print the datatypes of all columns of a data frame

In [46]:
grade.dtypes

StudentId      int64
English1       int64
Math1          int64
Science1       int64
OverallPct1    int64
dtype: object

#### Convert the Data Type of elements stored in a columns

In [47]:
#### .astype() method can be used to convert column data types

grade['English1'] = grade['English1'].astype('float32')

In [48]:
grade.dtypes

StudentId        int64
English1       float32
Math1            int64
Science1         int64
OverallPct1      int64
dtype: object

#### The most interesting of the data types in pandas is the "category" data type

* It is analogous to the factors data type in R

In [49]:
grade['StudentId'].astype('category')

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
Name: StudentId, dtype: category
Categories (20, int64): [1, 2, 3, 4, ..., 17, 18, 19, 20]

#### Setting / Changing the values of elements in the pandas data frame

In [50]:
grade[ grade['English1'] == 80 ] = np.nan

In [51]:
grade.loc[2,'Science1'] = np.nan

### Handling Missing Values

In [52]:
grade.head()

   StudentId  English1  Math1  Science1  OverallPct1
0        1.0      67.0   78.0      30.0         58.0
1        2.0      52.0   72.0      67.0         64.0
2        3.0      66.0   56.0       NaN         59.0
3        4.0      30.0   42.0      44.0         39.0
4        5.0      56.0   53.0      48.0         52.0

In [53]:
grade.isnull().sum()

StudentId      1
English1       1
Math1          1
Science1       2
OverallPct1    1
dtype: int64

#### Drop NA Values

In [54]:
grade_no_na = grade.dropna()

In [55]:
grade_no_na.isnull().sum()

StudentId      0
English1       0
Math1          0
Science1       0
OverallPct1    0
dtype: int64

In [56]:
grade_no_na.head()

   StudentId  English1  Math1  Science1  OverallPct1
0        1.0      67.0   78.0      30.0         58.0
1        2.0      52.0   72.0      67.0         64.0
3        4.0      30.0   42.0      44.0         39.0
4        5.0      56.0   53.0      48.0         52.0
5        6.0      75.0   53.0      77.0         68.0

#### Mean value Imputation

In [57]:
mean_values_to_impute = { k: i for k, i in zip(grade.columns.values, grade.mean().values)}

mean_values_to_impute

{'English1': 59.10526315789474,
 'Math1': 55.0,
 'OverallPct1': 55.89473684210526,
 'Science1': 53.388888888888886,
 'StudentId': 10.68421052631579}

In [58]:
grade_mean_imputation = grade.fillna(mean_values_to_impute)

In [59]:
grade_mean_imputation.isnull().sum()

StudentId      0
English1       0
Math1          0
Science1       0
OverallPct1    0
dtype: int64

In [60]:
grade.describe()

       StudentId   English1      Math1   Science1  OverallPct1
count  19.000000  19.000000  19.000000  18.000000    19.000000
mean   10.684211  59.105263  55.000000  53.388889    55.894737
std     6.018976  13.449059  13.424687  16.346033     9.218910
min     1.000000  30.000000  34.000000  30.000000    38.000000
25%     5.500000  50.000000  45.000000  41.000000    50.500000
50%    11.000000  62.000000  56.000000  54.000000    56.000000
75%    15.500000  69.000000  61.500000  66.750000    62.000000
max    20.000000  78.000000  78.000000  77.000000    70.000000

### Binning Data

In [61]:
bins = [30 , 40, 60, 80,100]

group_names = ['LowGrade', 'AverageGrade', 'GoodGrade', 'ExcellentGrade']

grade['Grades'] = pd.cut(grade['OverallPct1'], bins, labels = group_names)

In [62]:
grade.head()

   StudentId  English1  Math1  Science1  OverallPct1        Grades
0        1.0      67.0   78.0      30.0         58.0  AverageGrade
1        2.0      52.0   72.0      67.0         64.0     GoodGrade
2        3.0      66.0   56.0       NaN         59.0  AverageGrade
3        4.0      30.0   42.0      44.0         39.0      LowGrade
4        5.0      56.0   53.0      48.0         52.0  AverageGrade

#### Summary of dataset along with categorical data

In [63]:
grade.describe()

       StudentId   English1      Math1   Science1  OverallPct1
count  19.000000  19.000000  19.000000  18.000000    19.000000
mean   10.684211  59.105263  55.000000  53.388889    55.894737
std     6.018976  13.449059  13.424687  16.346033     9.218910
min     1.000000  30.000000  34.000000  30.000000    38.000000
25%     5.500000  50.000000  45.000000  41.000000    50.500000
50%    11.000000  62.000000  56.000000  54.000000    56.000000
75%    15.500000  69.000000  61.500000  66.750000    62.000000
max    20.000000  78.000000  78.000000  77.000000    70.000000

In [64]:
grade.describe(include = 'all')

        StudentId   English1      Math1   Science1  OverallPct1        Grades
count   19.000000  19.000000  19.000000  18.000000    19.000000            19
unique        NaN        NaN        NaN        NaN          NaN             3
top           NaN        NaN        NaN        NaN          NaN  AverageGrade
freq          NaN        NaN        NaN        NaN          NaN            12
mean    10.684211  59.105263  55.000000  53.388889    55.894737           NaN
std      6.018976  13.449059  13.424687  16.346033     9.218910           NaN
min      1.000000  30.000000  34.000000  30.000000    38.000000           NaN
25%      5.500000  50.000000  45.000000  41.000000    50.500000           NaN
50%     11.000000  62.000000  56.000000  54.000000    56.000000           NaN
75%     15.500000  69.000000  61.500000  66.750000    62.000000           NaN
max     20.000000  78.000000  78.000000  77.000000    70.000000           NaN

### Dummify Categorical Data

In [65]:
grade['Grades'].dtype

category

In [66]:
dummified_grades = pd.get_dummies(grade)

In [67]:
dummified_grades.head()

,StudentId,English1,Math1,Science1,OverallPct1,Grades_LowGrade,Grades_AverageGrade,Grades_GoodGrade,Grades_ExcellentGrade
0,1.0,67.0,78.0,30.0,58.0,0,1,0,0
1,2.0,52.0,72.0,67.0,64.0,0,0,1,0
2,3.0,66.0,56.0,NaN,59.0,0,1,0,0
3,4.0,30.0,42.0,44.0,39.0,1,0,0,0
4,5.0,56.0,53.0,48.0,52.0,0,1,0,0

# Intro to Scikit Learn

__The Scikit Learn library gives us to do the following data science operations and more__
* Feature extraction
* Classification
* Regression
* Clustering
* Dimension reduction
* Model selection
* Pipelines and Feature Unions

__Today we will be building scikit learn pipeline that would help us automate the datascience process__

## Two main methods to interface with scikit learn, estimators and transformers

* __The general api pattern for estimators is as follows__

![](img/sk_estimator_interface.jpg)

* __The general difference between the transformer and predictor apis are the predict() and transform() methods__

![](img/sk_transformer.jpg)

# Scikit Learn Pipelines

* __For now remember to use numpy arrays with scikit learn pipelines, packages such as sklearn-pandas are not production ready yet and issues with the unexpected behaviour of pandas when used with pipelines make them extremely unreliable__

![](img/sk_pipelines.jpeg)

![](img/engineering-pipelines.jpeg)

## Sklearn Transformers

#### Generate Random data for testing out the interface of scikit learn transformers

In [68]:
random_data = np.random.choice(a = 300000, size = 120).reshape(20, 6)

random_data

array([[229625,  11789,   7904,  91362,  99301, 173955],
       [299453, 287051,  42546, 118589,  58205, 134231],
       [265948,   5407,  69477, 167653, 218927,  83421],
       [139344, 120086, 152533, 212199, 142746, 225027],
       [ 23032, 214879,  63364, 297984, 280196, 111787],
       [ 54595, 278858,  86215, 143509, 268420,  33339],
       [ 37153, 188844, 214718,  41812, 241607, 241687],
       [158480, 200878, 144352, 257475,  97029, 200505],
       [284667, 131951, 183206,   4359, 145910, 170460],
       [202770, 215969,  83314, 171961, 185162, 247562],
       [137126,  46272, 241158,   5831, 204629, 148709],
       [163307, 287450,  71964,   7809,  53534, 283836],
       [146403, 165221, 114116, 276232,  69218, 206499],
       [218834, 205137,   9191, 173493, 138595,  80494],
       [ 14862,  42617, 260199, 104766, 104028, 238814],
       [ 21407,    102, 181652,  48541, 138043, 132682],
       [121716, 292987, 133563, 102643, 281275,  89871],
       [ 93193,  80963, 241865, 145408, 283403, 157931],
       [ 39936, 121473, 123908, 139667, 209298, 281804],
       [138993, 281323, 231597, 235236, 229820,  46860]])

### Range Normalizing the Data

In [69]:
from sklearn.preprocessing import MinMaxScaler

In [70]:
min_max_scaler = MinMaxScaler()

min_max_scaler.fit(random_data)

normalized_data = min_max_scaler.transform(random_data)

normalized_data

C:\Users\yoges\Anaconda3\lib\site-packages\sklearn\utils\validation.py:475: DataConversionWarning: Data with input dtype int32 was converted to float64 by MinMaxScaler.
  warnings.warn(msg, DataConversionWarning)

array([[0.75463736, 0.03990303, 0.        , 0.29630651, 0.19910036,
        0.56134804],
       [1.        , 0.97973266, 0.13730752, 0.38903363, 0.02032027,
        0.4027673 ],
       [0.88226964, 0.01811291, 0.24405161, 0.55613112, 0.71950981,
        0.19993054],
       [0.43740666, 0.4096625 , 0.57325353, 0.70784163, 0.38809931,
        0.76523072],
       [0.02870786, 0.73331512, 0.21982203, 1.        , 0.98604858,
        0.31316942],
       [0.13961439, 0.95175922, 0.31039458, 0.47390379, 0.9348194 ,
        0.        ],
       [0.07832644, 0.64442358, 0.81973087, 0.12755385, 0.8181747 ,
        0.8317385 ],
       [0.50464702, 0.68551138, 0.54082721, 0.86203831, 0.18921647,
        0.66733733],
       [0.94804474, 0.45017328, 0.69482947, 0.        , 0.40186367,
        0.54739578],
       [0.66027387, 0.73703672, 0.29889613, 0.57080289, 0.5726218 ,
        0.85519188],
       [0.42961302, 0.15763866, 0.92452883, 0.0050132 , 0.65730916,
        0.4605644 ],
       [0.5216082 , 0.98109497, 0.25390911, 0.01174968, 0.        ,
        1.        ],
       [0.46221068, 0.56376735, 0.42098337, 0.92591911, 0.06823017,
        0.69126576],
       [0.71671978, 0.70005292, 0.00510117, 0.57602043, 0.3700412 ,
        0.18824577],
       [0.        , 0.14515936, 1.        , 0.34195658, 0.21966424,
        0.8202693 ],
       [0.02299792, 0.        , 0.68867001, 0.15047084, 0.36763983,
        0.39658359],
       [0.37546514, 1.        , 0.49806377, 0.33472627, 0.99074255,
        0.22567935],
       [0.27524061, 0.27608447, 0.9273311 , 0.48037122, 1.        ,
        0.49737921],
       [0.08810539, 0.41439814, 0.45979508, 0.46081907, 0.67762073,
        0.99188813],
       [0.43617332, 0.9601755 , 0.88663271, 0.78629885, 0.76689767,
        0.05397669]])

### Standardizing the Data

In [71]:
from sklearn.preprocessing import StandardScaler

In [72]:
standard_scaler = StandardScaler()

standard_scaler.fit(random_data)

standardized_data = standard_scaler.transform(random_data)

C:\Users\yoges\Anaconda3\lib\site-packages\sklearn\utils\validation.py:475: DataConversionWarning: Data with input dtype int32 was converted to float64 by StandardScaler.
  warnings.warn(msg, DataConversionWarning)

### Building ML Models using Sklearn Estimators and Pipelines

![](img/mnist_data.jpeg)

In [73]:
from sklearn.datasets import load_digits

X, Y = load_digits().data, load_digits().target

### TRAIN - TEST SPLIT

In [74]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size= 0.3, random_state=42)

In [75]:
from sklearn.linear_model import LogisticRegression

predictiveModel = LogisticRegression()

In [76]:
predictiveModel.fit(X_train, Y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [77]:
Y_preds = predictiveModel.predict(X_test)

In [78]:
from sklearn.metrics import accuracy_score

In [79]:
accuracy_score(Y_test, Y_preds)

0.9537037037037037

In [80]:
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler

pipe = Pipeline(steps = [("scale", StandardScaler()), ("logreg", predictiveModel)])

In [81]:
pipe.fit(X_train, Y_train)

Pipeline(memory=None,
     steps=[('scale', StandardScaler(copy=True, with_mean=True, with_std=True)), ('logreg', LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False))])

In [82]:
Y_pipe_preds = pipe.predict(X_test)

In [83]:
accuracy_score(Y_test, Y_pipe_preds)

0.9648148148148148

# Numpy Cheat Sheet

![](img/numpy_cheat_sheet.png)

# Pandas Cheat Sheet

![](img/pandas_cheat_sheet.jpg)

# Scikit Learn Cheat Sheet

![](img/scikit_cheat_sheet.jpg)